case/0/wallShearStressPP
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStressPP;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    consoleFluid
    {
        type            calculated;
        value           nonuniform List<vector> 
31770
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
    inletFluid
    {
        type            calculated;
        value           nonuniform List<vector> 
579
(
(0.300035 34.1824 -0.660324)
(0.227535 25.2841 -0.486482)
(0.234628 26.6939 -0.508078)
(0.329807 37.5984 -0.726656)
(0.294383 33.7835 -0.650394)
(0.271939 31.1936 -0.600399)
(0.296106 33.7839 -0.650448)
(0.334284 36.7476 -0.691034)
...
)
;
    }
    outlet1Fluid
    {
        type            calculated;
        value           uniform (-0 -0 -0);
    }
    outlet2Fluid
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet3Fluid
    {
        type            calculated;
        value           uniform (-0 -0 -0);
    }
}


// ************************************************************************* //
